app/views/customers/_form.html.erb

    <%= f.label 'Otel Name' %><br>
    <%= f.collection_select( :otelid, Otel.all, :id, :Oname,:selected => @select_value,:prompt=> true) %><br><br><br>
---
SELECT "otels".* FROM "otels"