app/controllers/customers_controller.rb

  def create
    @customer = Customer.new(customer_params)

    respond_to do |format|
      if @customer.save
---
INSERT INTO "customers" ("adress", "created_at", "email", "name", "phone", "surname", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["adress", ""], ["created_at", Tue, 12 Nov 2013 19:00:28 UTC +00:00], ["email", ""], ["name", "gokberk"], ["phone", ""], ["surname", "hayali"], ["updated_at", Tue, 12 Nov 2013 19:00:28 UTC +00:00]]

  def update
    respond_to do |format|
      if @customer.update(customer_params)
---
UPDATE "customers" SET "name" = ?, "surname" = ?, "email" = ?, "phone" = ?, "adress" = ?, "updated_at" = ? WHERE "customers"."id" = 2  [["name", "baris"], ["surname", "aytekin"], ["email", "baris@gmail.com"], ["phone", "05366546565"], ["adress", "E"], ["updated_at", Sat, 16 Nov 2013 15:46:51 UTC +00:00]]