app/controllers/otels_controller.rb

SELECT "otels".* FROM "otels"
---
  def index
    @otels = Otel.all

INSERT INTO "otels" ("Oadress", "Oemail", "Oname", "Ophone", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @otel = Otel.new(otel_params)

    respond_to do |format|
      if @otel.save

UPDATE "otels" SET "Oemail" = ?, "Ophone" = ?, "Oadress" = ?, "updated_at" = ? WHERE "otels"."id" = 2  [["Oemail", "info@otelshine"], ["Ophone", "02126589663"], ["Oadress", "Besiktas"], ["updated_at", Tue, 12 Nov 2013 18:37:12 UTC +00:00]]
---
  def update
    respond_to do |format|
      if @otel.update(otel_params)

DELETE FROM "otels" WHERE "otels"."id" = ?  [["id", 2]]
---
  def destroy
    @otel.destroy

SELECT "otels".* FROM "otels" WHERE "otels"."id" = ? LIMIT 1  [["id", "2"]]
---
    def set_otel
      @otel = Otel.find(params[:id])